Repository: ProxymanApp/proxyman-localization
Catalog: macOS/Scripts.xcstrings
Source language: en
Languages: zh_hans

# 1da-pd-oJb.title
source: Export Settings
zh_hans: 导出设置

# 1Lv-MJ-8mP.title
source: New Folder
zh_hans: 新建文件夹

# 2bf-R9-Ugc.ibShadowedToolTip
source: Import selected file and import to JS Code
zh_hans: 导入选定文件并导入到 JS 代码

# 2bf-R9-Ugc.title
source: Import JSON or Other File...
zh_hans: 导入 JSON 或其他文件…

# 2Rf-8t-48p.ibExternalAccessibilityDescription
source: Enable or Disable entire Map Local Feature
zh_hans: 启用或禁用整个本地映射功能

# 2WF-c9-ZLL.ibShadowedToolTip
source: Export Rules that you can share with your teammates. Export the script and all imported files
zh_hans: 导出规则，与你的团队成员分享。导出脚本及所有导入的文件

# 2WF-c9-ZLL.title
source: Scripts and All Imported Files...
zh_hans: 脚本和所有导入的文件…

# 3oU-SJ-b4w.ibShadowedToolTip
source: If Mock API is enabled, the request never hits your server. You have to provide the response. It's useful for testing.
zh_hans: 如果启用了 Mock API，请求将不会到达你的服务器。你必须提供响应。这对于测试非常有用。

# 3ZA-n0-5rl.title
source: Console
zh_hans: 控制台

# 4iP-OB-Htr.title
source: More
zh_hans: 更多

# 5vf-Gb-QcQ.title
source: Matching Rule
zh_hans: 匹配规则

# 5YF-9i-XFK.title
source: Configs
zh_hans: 配置

# 6OV-n0-cWR.ibShadowedToolTip
source: Run onResponse() function
zh_hans: 运行 onResponse() 函数

# 6wv-8S-F2I.title
source: New…
zh_hans: 新建…

# 8ag-ls-KoV.title
source: Environment Variables
zh_hans: 环境变量

# 8ts-qc-3RB.title
source: Run Script on:
zh_hans: 运行脚本于：

# 15j-Xz-hKk.ibShadowedToolTip
source: Automatically Save file after 1 second
zh_hans: 在 1 秒后自动保存文件

# 49J-je-yD2.headerCell.title
source: Matching Rule
zh_hans: 匹配规则

# 49J-je-yD2.headerToolTip
source: Matching URLs
zh_hans: 匹配 URLs

# 60p-Do-eUa.title
source: Run as Mock API
zh_hans: 作为 Mock API 运行

# 783-cf-8NW.ibShadowedToolTip
source: Import Script Rules
zh_hans: 导入脚本规则

# 783-cf-8NW.title
source: From Proxyman...
zh_hans: 来自 Proxyman...

# abR-Dt-dL5.title
source: Delete
zh_hans: 删除

# AEe-Ox-jZb.title
source: Use console.log() to log events
zh_hans: 使用 console.log() 记录事件

# aKx-Yl-Bem.title
source: New Folder
zh_hans: 新建文件夹

# aU8-kO-YbB.title
source: Configs
zh_hans: 配置

# B6T-WK-Jh2.headerCell.title
source: Name
zh_hans: 名称

# B7H-Qn-1GV.ibShadowedLabels[0]
source: Snippet Code
zh_hans: 代码片段

# bcp-ip-pRf.title
source: Request
zh_hans: 请求

# Beb-ek-dt4.title
source: Import Settings
zh_hans: 导入设置

# cbG-2v-RmG.title
source: Scripting
zh_hans: 脚本

# cGe-FP-Cga.title
source: Name:
zh_hans: 名称：

# cyH-Yq-dxO.title
source: Each request is checked against the rules from top to bottom, stopping when a match is found.
zh_hans: 每个请求都会按照从上到下的规则进行检查，直到找到匹配项为止。

# e2Q-na-x9J.title
source: Open local file with
zh_hans: 用本地文件打开

# EAa-s4-6jg.ibShadowedToolTip
source: Export Rules that you can share with your teammates. Only Export the Script
zh_hans: 导出可以与队友共享的规则。仅导出脚本

# EAa-s4-6jg.title
source: Only Scripts...
zh_hans: 仅脚本...

# eTe-5h-VxL.title
source: Duplicate
zh_hans: 复制

# eTX-mK-u1J.title
source: Addon Docs...
zh_hans: 插件文档...

# FGU-E6-oNK.ibShadowedToolTip
source: Clear all Logs
zh_hans: 清除所有日志

# fS1-RA-owo.title
source: Errors
zh_hans: 错误

# fuE-sP-WQe.title
source: Allow Running Multiple Scripts for one Requests
zh_hans: 允许对一个请求运行多个脚本

# g2c-Km-UdJ.ibShadowedToolTip
source: Hide Proxyman logs, just display user logs
zh_hans: 隐藏 Proxyman 日志，仅显示用户日志

# g2c-Km-UdJ.title
source: Hide Proxyman Logs in Console Log
zh_hans: 在控制台日志中隐藏 Proxyman 日志

# gB7-cb-JeF.ibShadowedToolTip
source: Toggl Enable / Disable selected rules
zh_hans: 切换启用/禁用选定规则

# gB7-cb-JeF.title
source: Enable Rule
zh_hans: 启用规则

# geb-sb-72N.ibShadowedToolTip
source: Save and write the current editing script to disk and activate it ⌘S
zh_hans: 保存并写入当前编辑的脚本到磁盘并激活它 ⌘S

# GKe-oa-O4D.title
source: Multiple Scripts Mode: A Request/Response can be run with multiple scripts.
zh_hans: 多脚本模式：一个请求/响应可以与多个脚本一起运行。

# Gmm-Ye-msV.ibShadowedToolTip
source: Clear all Logs
zh_hans: 清除所有日志

# gMu-9e-6Pa.title
source: Allow all scripts to access Environment Variables
zh_hans: 允许所有脚本访问环境变量

# had-X8-9CN.ibShadowedToolTip
source: Open Doc how to write your own JS Addons
zh_hans: 打开文档以了解如何编写自己的 JS 插件

# had-X8-9CN.title
source: Write your Custom Addons...
zh_hans: 编写自定义插件...

# HAk-P0-Ggj.ibShadowedToolTip
source: If there is new log, the Console Log will automatically scroll to the bottom
zh_hans: 如果有新的日志，控制台日志将自动滚动到底部

# HAk-P0-Ggj.title
source: Scroll to the bottom when there are new logs in Console Log
zh_hans: 在控制台日志中有新的日志时滚动到底部

# J3H-pt-2P2.title
source: Log Levels:
zh_hans: 日志级别：

# jKu-Bl-Yq1.title
source: Environment Variables Docs...
zh_hans: 环境变量文档...

# JWv-dU-riJ.title
source: More
zh_hans: 更多

# l1b-qK-UkR.title
source: Click "+" or ⌘N to add new entry
zh_hans: 点击 "+" 或 ⌘N 添加新条目

# lcF-Es-cZG.ibShadowedToolTip
source: Run onRequest() function
zh_hans: 运行 onRequest() 函数

# Lhy-az-aCd.title
source: Reload
zh_hans: 重新加载

# MiB-Ry-kOU.title
source: Enable Scripting Tool
zh_hans: 启用脚本工具

# Mqj-S5-ILV.placeholderString
source: Untitled
zh_hans: 无标题

# Mqj-S5-ILV.title
source: Untitled
zh_hans: 无标题

# NAx-5y-WsM.title
source: Allow Scripts to read System Environment Variables
zh_hans: 允许脚本读取系统环境变量

# ng1-oM-8Fe.title
source: Save & Activate ⌘S
zh_hans: 保存并激活 ⌘S

# Oef-H5-Fx6.ibShadowedToolTip
source: Select Log Level Modes
zh_hans: 选择日志级别模式

# oIC-SX-Ukm.headerCell.title
source: Method
zh_hans: 方法

# P2I-vf-6Nq.title
source: Show in Finder…
zh_hans: 在查找器中显示…

# Pai-wM-2Ib.ibShadowedToolTip
source: Rename the folder
zh_hans: 重命名文件夹

# Pai-wM-2Ib.title
source: Rename Folder
zh_hans: 重命名文件夹

# pd1-dJ-1xJ.title
source: User Logs
zh_hans: 用户日志

# pqi-Ez-pOT.title
source: Warnings
zh_hans: 警告

# qn2-FC-Zed.title
source: Environment Variables
zh_hans: 环境变量

# r7y-sY-uEN.title
source: Documentations
zh_hans: 文档

# REd-lu-zQJ.title
source: System
zh_hans: 系统

# rKN-8X-nR8.ibShadowedToolTip
source: Beautify the current JS Code
zh_hans: 格式化当前 JS 代码

# rKN-8X-nR8.title
source: Beautify (⌘B)
zh_hans: 格式化 (⌘B)

# sn6-ZI-OLN.title
source: Advance
zh_hans: 高级

# SQj-Kh-Qo7.title
source: New: ⌘N Edit: ⌘⏎ Delete: ⌘⌫ Duplicate: ⌘D Toggle Rules: ␣
zh_hans: 新建：⌘N 编辑：⌘⏎ 删除：⌘⌫ 复制：⌘D 切换规则：␣

# syJ-gL-Mcz.title
source: Saved
zh_hans: 已保存

# TNq-P4-Q5X.ibShadowedToolTip
source: Open Custom Addon Folder
zh_hans: 打开自定义插件文件夹

# TNq-P4-Q5X.title
source: Open Custom Addons Folder...
zh_hans: 打开自定义插件文件夹...

# xDt-jD-ufF.title
source: Built-in JS Libraries Docs...
zh_hans: 内置 JS 库文档...

# Xgd-Wq-j8M.title
source: Filter
zh_hans: 过滤器

# xq9-8g-BbV.title
source: Modify the Request or Response automatically with Javascript. Support URL, Status Code, Header, Method, and Body.
zh_hans: 使用 Javascript 自动修改请求或响应。支持 URL、状态码、头部、方法和正文。

# Xu2-KD-YTP.title
source: Response
zh_hans: 响应

# yiM-oB-Nsu.title
source: Documentations
zh_hans: 文档

# YL8-Qr-mAC.title
source: Scripting Docs...
zh_hans: 脚本文档...

# Yvx-rH-ffi.title
source: Script Editor
zh_hans: 脚本编辑器

# Zby-zp-y61.ibShadowedToolTip
source: Show / Hide Logging Console Panel (⇧⌘L)
zh_hans: 显示 / 隐藏日志控制台面板 (⇧⌘L)

# zhY-mM-T6l.title
source: Edit
zh_hans: 编辑

# zqy-Ug-Jk0.title
source: Empty Console
zh_hans: 清空控制台

# ZsG-F5-h2j.title
source: Import Settings
zh_hans: 导入设置

# ZVw-hV-auO.ibShadowedToolTip
source: Clear all shared State data. It's similar with `clearSharedState()` function
zh_hans: 清除所有共享状态数据。这与 `clearSharedState()` 函数类似

# ZVw-hV-auO.title
source: Reset Shared State
zh_hans: 重置共享状态

# ZYc-UB-srh.title
source: Export Settings
zh_hans: 导出设置
